## Python Pandas Tutorial Part-16

# Pandas Groupby

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('F:\\Machine Learning\\DataSet\\student_result1.csv')
df

   Student ID Section  Class  Study hrs  Social Media usage hrs  Percentage
0        1001       A     10          2                       3          50
1        1002       B     10          6                       2          80
2        1003       A     10          3                       2          60
3        1004       C     11          0                       1          45
4        1005       C     12          5                       2          75

In [3]:
gr1 = df.groupby(by = 'Section')
gr1

In [5]:
gr1.groups

{'A': Int64Index([0, 2], dtype='int64'),
 'B': Int64Index([1], dtype='int64'),
 'C': Int64Index([3, 4], dtype='int64')}

In [6]:
df.groupby(['Section', 'Class']).groups

{('A', 10): Int64Index([0, 2], dtype='int64'),
 ('B', 10): Int64Index([1], dtype='int64'),
 ('C', 11): Int64Index([3], dtype='int64'),
 ('C', 12): Int64Index([4], dtype='int64')}

In [7]:
for Class, df_1 in gr1:
    print(Class)
    print(df_1)

A
   Student ID Section  Class  Study hrs  Social Media usage hrs  Percentage
0        1001       A     10          2                       3          50
2        1003       A     10          3                       2          60
B
   Student ID Section  Class  Study hrs  Social Media usage hrs  Percentage
1        1002       B     10          6                       2          80
C
   Student ID Section  Class  Study hrs  Social Media usage hrs  Percentage
3        1004       C     11          0                       1          45
4        1005       C     12          5                       2          75

In [8]:
list(gr1)

[('A',
     Student ID Section  Class  Study hrs  Social Media usage hrs  Percentage
  0        1001       A     10          2                       3          50
  2        1003       A     10          3                       2          60),
 ('B',
     Student ID Section  Class  Study hrs  Social Media usage hrs  Percentage
  1        1002       B     10          6                       2          80),
 ('C',
     Student ID Section  Class  Study hrs  Social Media usage hrs  Percentage
  3        1004       C     11          0                       1          45
  4        1005       C     12          5                       2          75)]

In [9]:
dict(list(gr1))

{'A':    Student ID Section  Class  Study hrs  Social Media usage hrs  Percentage
 0        1001       A     10          2                       3          50
 2        1003       A     10          3                       2          60,
 'B':    Student ID Section  Class  Study hrs  Social Media usage hrs  Percentage
 1        1002       B     10          6                       2          80,
 'C':    Student ID Section  Class  Study hrs  Social Media usage hrs  Percentage
 3        1004       C     11          0                       1          45
 4        1005       C     12          5                       2          75}

In [10]:
#Selecting a group
 
# A single group can be selected using get_group():
 
gr3 = df.groupby('Class').get_group(10)
gr3

   Student ID Section  Class  Study hrs  Social Media usage hrs  Percentage
0        1001       A     10          2                       3          50
1        1002       B     10          6                       2          80
2        1003       A     10          3                       2          60

In [11]:
gr3 = df.groupby('Section').get_group('A')
gr3

   Student ID Section  Class  Study hrs  Social Media usage hrs  Percentage
0        1001       A     10          2                       3          50
2        1003       A     10          3                       2          60

In [12]:
# Applying a function into group
gr1.sum()

         Student ID  Class  Study hrs  Social Media usage hrs  Percentage
Section
A              2004     20          5                       5         110
B              1002     10          6                       2          80
C              2009     23          5                       3         120

In [13]:
gr1.mean()

         Student ID  Class  Study hrs  Social Media usage hrs  Percentage
Section
A            1002.0   10.0        2.5                     2.5        55.0
B            1002.0   10.0        6.0                     2.0        80.0
C            1004.5   11.5        2.5                     1.5        60.0

In [14]:
gr1.describe()

        Class                                                 Percentage  \
        count  mean       std   min    25%   50%    75%   max      count
Section
A         2.0  10.0  0.000000  10.0  10.00  10.0  10.00  10.0        2.0
B         1.0  10.0       NaN  10.0  10.00  10.0  10.00  10.0        1.0
C         2.0  11.5  0.707107  11.0  11.25  11.5  11.75  12.0        2.0

              ...  Student ID         Study hrs                            \
         mean ...         75%     max     count mean       std  min   25%
Section       ...
A        55.0 ...     1002.50  1003.0       2.0  2.5  0.707107  2.0  2.25
B        80.0 ...     1002.00  1002.0       1.0  6.0       NaN  6.0  6.00
C        60.0 ...     1004.75  1005.0       2.0  2.5  3.535534  0.0  1.25


         50%   75%  max
Section
A        2.5  2.75  3.0
B        6.0  6.00  6.0
C        2.5  3.75  5.0

[3 rows x 40 columns]

In [15]:
gr1.agg(['sum', 'max', 'mean'])

        Student ID               Class           Study hrs           \
               sum   max    mean   sum max  mean       sum max mean
Section
A             2004  1003  1002.0    20  10  10.0         5   3  2.5
B             1002  1002  1002.0    10  10  10.0         6   6  6.0
C             2009  1005  1004.5    23  12  11.5         5   5  2.5

        Social Media usage hrs          Percentage
                           sum max mean        sum max mean
Section
A                            5   3  2.5        110  60   55
B                            2   2  2.0         80  80   80
C                            3   2  1.5        120  75   60